// Задача_1 "Вывести квадрат числа"

Console.WriteLine("Введите число:");
int number = Convert.ToInt32(Console.ReadLine());

int squaredNumber  = number*number;

Console.WriteLine($"Квадрат числа {number} равен {squaredNumber}");