// Найти третью цифру числа, или сообщить, что ее нет

/*Console.WriteLine("Введите число:");

string number = Console.ReadLine();

int i;

if ()*/


