// Задача 10: "Показать последнюю цифру трехзначного числа"

System.Console.WriteLine("Введите трехзначное число:");
string N = Console.ReadLine();

System.Console.WriteLine(N);
