// Задача 10: "Показать последнюю цифру трехзначного числа"

System.Console.WriteLine("Введите трехзначное число:");
string number = Console.ReadLine();


System.Console.WriteLine($"Последняя цифра вашего числа: {number[2]}");
